import os
import pandas as pd


class DataToTxt(object):
    def __init__(self, dirName):
        self.dirName = dirName

    def transferData(self, file):
        ################################################################################
        # 因为我同时存了几个py脚本，所以我做了一个判断，不会读取.py文件
        #####################################################################################
        if file.split('.')[2] != 'py':
            ############################################################
            # 通过pandas读取json
            ###########################################################
            json_file = pd.read_json(file)
            for i in range(len(json_file)):
                # print(i)
                #########################################################################
                # 取到每一个item
                ########################################################################
                txtFile = json_file.loc[i]
                #################################################################################
                # 判断txtFile中的Data值是否为空，因为提供的json文件里，如果图片状态为跳过，则没有Data数据，此时下面
                # 的txtFile.Data['classifications']是不存在的，因此在for j in data的时候会报错(因为data不存在)
                #################################################################################
                if len(txtFile.Data) > 0:
                    ##########################################################################
                    # 如果txtFile中的Data值不为空，则赋值为data变量(即暂存data这个变量)
                    ##########################################################################
                    data = txtFile.Data['classifications']
                    ##########################################################################
                    # 定义一个空数组，根据json的结构，一个标签对应由一个activeOption，但是最后输出的结果
                    # 要求是一张图片所有标签的集合，因此这个result数组就是后面存储这张图片所有选择的标签的结果
                    ##########################################################################
                    result = []
                    ##################################################################################
                    # 由于第一个元素是图片名称，这里可以直接先将图片名称存到result中，此时result = [imageName,]
                    #####################################################################################
                    result.append(txtFile.imageName)
                    ####################################################################################
                    # 循环上面的临时变量data，找到每个标签activeOption, 这里的activeOption就是选择的比如 1-人脸 3-黄色
                    ####################################################################################
                    for j in data:
                        ##############################################################################################
                        # 将每一个结果插入result中，append方法是在数组最后一位插入一个值，使用split('-')方法，将字符串"1-人脸"切割为['1', '-', '人脸']
                        # 然后按照要求，只取数字，此时数字的索引是第一位，即[0]
                        #############################################################################################
                        result.append(j['activeOption'].split('-')[0])
                    ################################################################################
                    # 定义一个临时变量，即最后的输出的结果，此时result = [imageName, '1', '2', '3', .....]
                    # 由于写入txt的是一个字符串，即要将数组转为字符串类型，即list -> string，这里使用str.join(list)方法
                    # 注意最后模板txt中元素之间是通过' '(空格)连接，所以只用使用' '.join(result)
                    ################################################################################
                    final = ' '.join(result)
                    ###########################################################################################
                    # 这里使用python写入txt的方法，with open(filename, 'w') as f:的形式，filename因为要和图片名称对应
                    # 所以这里取文件名，但是注意，文件名因为是'xxxxxx.jpg/jpeg/png'结尾，所以通过split('.')方法，取到xxxxxx
                    # + '.txt'形式硬编码变为txt的文件名，即'xxxxxxx.txt'
                    #############################################################################################
                    with open(txtFile.imageName.split('.')[0] + '.txt', 'w') as file_handle:
                        ###########################################################################
                        # 将最后final结果写进txt文件并保存
                        ############################################################################
                        file_handle.write(final)
                        file_handle.write(' ')
                        print('write success')

    def getData(self, dirName):
        files = []
        for root, dirs, filename in os.walk(dirName):
            for singleFile in filename:
                self.transferData(os.path.join(root, singleFile))


transDir = DataToTxt('./')
transDir.getData('./')
